espressif/esp-idf/components/soc/esp32s2beta/include/soc/spi_mem_struct.h
            uint32_t hold_ena:   2;                             /*This register is for two SPI masters to share the same cs clock and data signals. The bits of one SPI are set  if the other SPI is busy  the SPI will be hold. 1(3): hold at  idle  phase 2: hold at  prepare  phase.*/
            uint32_t reserved2: 30;                             /*reserved*/
        };
        uint32_t val;
    } hold;
    union {
        struct {
            uint32_t dma_rx_ena:        1;                      /*spi dma rx data enable.*/
            uint32_t dma_tx_ena:        1;                      /*spi dma tx data enable.*/
            uint32_t in_rst:            1;                      /*The bit is used to reset in dma fsm and in data fifo pointer.*/
            uint32_t out_rst:           1;                      /*The bit is used to reset out dma fsm and out data fifo pointer.*/
            uint32_t ahbm_fifo_rst:     1;                      /*Reset spi dma ahb master fifo pointer.*/
            uint32_t ahbm_rst:          1;                      /*Reset spi dma ahb master.*/
            uint32_t in_loop_test:      1;                      /*Set bit to test in link.*/
            uint32_t out_loop_test:     1;                      /*Set bit to test out link.*/
            uint32_t out_auto_wrback:   1;                      /*when the bit is set  DMA continue to use the next inlink node when the length of inlink is 0.*/
            uint32_t out_eof_mode:      1;                      /*out eof flag generation mode . 1: when dma pop all data from fifo  0:when ahb push all data to fifo.*/
            uint32_t outdscr_burst_en:  1;                      /*read descriptor use burst mode when read data for memory.*/
            uint32_t indscr_burst_en:   1;                      /*read descriptor use burst mode when write data to memory.*/
            uint32_t out_data_burst_en: 1;                      /*spi dma read data from memory in burst mode.*/
            uint32_t dma_mem_trans_ena: 1;                      /*reserved*/
            uint32_t dma_rx_stop:       1;                      /*spi dma read data stop  when in continue tx/rx mode.*/
            uint32_t dma_tx_stop:       1;                      /*spi dma write data stop when in continue tx/rx mode.*/
            uint32_t dma_continue:      1;                      /*spi dma continue tx/rx data.*/
            uint32_t reserved17:       15;                      /*reserved*/
        };
        uint32_t val;
    } dma_conf;
    union {
        struct {
            uint32_t addr:           20;                        /*The address of the first outlink descriptor.*/
            uint32_t reserved20:      8;                        /*reserved*/
            uint32_t stop:            1;                        /*Set the bit to stop to use outlink descriptor.*/
            uint32_t start:           1;                        /*Set the bit to start to use outlink descriptor.*/
            uint32_t restart:         1;                        /*Set the bit to mount on new outlink descriptors.*/
            uint32_t reserved31:      1;                        /*reserved*/
        };
        uint32_t val;
    } dma_out_link;
    union {
        struct {
            uint32_t addr:           20;                        /*The address of the first inlink descriptor.*/
            uint32_t auto_ret:        1;                        /*when the bit is set  the inlink descriptor returns to the first link node when a packet is error.*/
            uint32_t reserved21:      7;                        /*reserved*/
            uint32_t stop:            1;                        /*Set the bit to stop to use inlink descriptor.*/
            uint32_t start:           1;                        /*Set the bit to start to use inlink descriptor.*/
            uint32_t restart:         1;                        /*Set the bit to mount on new inlink descriptors.*/
            uint32_t reserved31:      1;                        /*reserved*/
        };
        uint32_t val;
    } dma_in_link;
    union {
        struct {
            uint32_t inlink_dscr_empty:          1;             /*The enable bit for lack of enough inlink descriptors.*/
            uint32_t outlink_dscr_error:         1;             /*The enable bit for outlink descriptor error.*/
            uint32_t inlink_dscr_error:          1;             /*The enable bit for inlink descriptor error.*/
            uint32_t in_done:                    1;             /*The enable bit for completing usage of a inlink descriptor.*/
            uint32_t in_err_eof:                 1;             /*The enable bit for receiving error.*/
            uint32_t in_suc_eof:                 1;             /*The enable bit for completing receiving all the packets from host.*/
            uint32_t out_done:                   1;             /*The enable bit for completing usage of a outlink descriptor .*/
            uint32_t out_eof:                    1;             /*The enable bit for sending a packet to host done.*/
            uint32_t out_total_eof:              1;             /*The enable bit for sending all the packets to host done.*/
            uint32_t reserved9:                 23;             /*reserved*/
        };
        uint32_t val;
    } dma_int_ena;
    union {
        struct {
            uint32_t inlink_dscr_empty:          1;             /*The raw bit for lack of enough inlink descriptors.*/
            uint32_t outlink_dscr_error:         1;             /*The raw bit for outlink descriptor error.*/
            uint32_t inlink_dscr_error:          1;             /*The raw bit for inlink descriptor error.*/
            uint32_t in_done:                    1;             /*The raw bit for completing usage of a inlink descriptor.*/
            uint32_t in_err_eof:                 1;             /*The raw bit for receiving error.*/
            uint32_t in_suc_eof:                 1;             /*The raw bit for completing receiving all the packets from host.*/
            uint32_t out_done:                   1;             /*The raw bit for completing usage of a outlink descriptor.*/
            uint32_t out_eof:                    1;             /*The raw bit for sending a packet to host done.*/
            uint32_t out_total_eof:              1;             /*The raw bit for sending all the packets to host done.*/
            uint32_t reserved9:                 23;             /*reserved*/
        };
        uint32_t val;
    } dma_int_raw;
    union {
        struct {
            uint32_t inlink_dscr_empty:         1;              /*The status bit for lack of enough inlink descriptors.*/
            uint32_t outlink_dscr_error:        1;              /*The status bit for outlink descriptor error.*/
            uint32_t inlink_dscr_error:         1;              /*The status bit for inlink descriptor error.*/
            uint32_t in_done:                   1;              /*The status bit for completing usage of a inlink descriptor.*/
            uint32_t in_err_eof:                1;              /*The status bit for receiving error.*/
            uint32_t in_suc_eof:                1;              /*The status bit for completing receiving all the packets from host.*/
            uint32_t out_done:                  1;              /*The status bit for completing usage of a outlink descriptor.*/
            uint32_t out_eof:                   1;              /*The status bit for sending a packet to host done.*/
            uint32_t out_total_eof:             1;              /*The status bit for sending all the packets to host done.*/
            uint32_t reserved9:                23;              /*reserved*/
        };
        uint32_t val;
    } dma_int_st;
    union {
        struct {
            uint32_t inlink_dscr_empty:          1;             /*The clear bit for lack of enough inlink descriptors.*/
            uint32_t outlink_dscr_error:         1;             /*The clear bit for outlink descriptor error.*/
            uint32_t inlink_dscr_error:          1;             /*The clear bit for inlink descriptor error.*/
            uint32_t in_done:                    1;             /*The clear bit for completing usage of a inlink descriptor.*/
            uint32_t in_err_eof:                 1;             /*The clear bit for receiving error.*/
            uint32_t in_suc_eof:                 1;             /*The clear bit for completing receiving all the packets from host.*/
            uint32_t out_done:                   1;             /*The clear bit for completing usage of a outlink descriptor.*/
            uint32_t out_eof:                    1;             /*The clear bit for sending a packet to host done.*/
            uint32_t out_total_eof:              1;             /*The clear bit for sending all the packets to host done.*/
            uint32_t reserved9:                 23;             /*reserved*/
        };
        uint32_t val;
    } dma_int_clr;
    uint32_t dma_in_err_eof_des_addr;                               /*The inlink descriptor address when spi dma produce receiving error.*/
    uint32_t dma_in_suc_eof_des_addr;                               /*The last inlink descriptor address when spi dma produce from_suc_eof.*/
    uint32_t dma_inlink_dscr;                                       /*The content of current in descriptor pointer.*/
    uint32_t dma_inlink_dscr_bf0;                                   /*The content of next in descriptor pointer.*/
    uint32_t dma_inlink_dscr_bf1;                                   /*The content of current in descriptor data buffer pointer.*/
    uint32_t dma_out_eof_bfr_des_addr;                              /*The address of buffer relative to the outlink descriptor that produce eof.*/
    uint32_t dma_out_eof_des_addr;                                  /*The last outlink descriptor address when spi dma produce to_eof.*/
    uint32_t dma_outlink_dscr;                                      /*The content of current out descriptor pointer.*/
    uint32_t dma_outlink_dscr_bf0;                                  /*The content of next out descriptor pointer.*/
    uint32_t dma_outlink_dscr_bf1;                                  /*The content of current out descriptor data buffer pointer.*/
    union {
        struct {
            uint32_t out_dscr_addr:    18;                      /*SPI dma out descriptor address.*/
            uint32_t out_dscr_state:    2;                      /*SPI dma out descriptor state.*/
            uint32_t out_state:         3;                      /*SPI dma out data state.*/
            uint32_t out_fifo_cnt:      7;                      /*The remains of SPI dma outfifo data.*/
            uint32_t out_fifo_full:     1;                      /*SPI dma outfifo is full.*/
            uint32_t out_fifo_empty:    1;                      /*SPI dma outfifo is empty.*/
        };
        uint32_t val;
    } dma_out_status;
    union {
        struct {
            uint32_t in_dscr_addr:    18;                       /*SPI dma in descriptor address.*/
            uint32_t in_dscr_state:    2;                       /*SPI dma in descriptor state.*/
            uint32_t in_state:         3;                       /*SPI dma in data state.*/
            uint32_t in_fifo_cnt:      7;                       /*The remains of SPI dma infifo data.*/
            uint32_t in_fifo_full:     1;                       /*SPI dma infifo is full.*/
            uint32_t in_fifo_empty:    1;                       /*SPI dma infifo is empty.*/
        };
        uint32_t val;
    } dma_in_status;
    uint32_t data_buf[16];                                                /*data buffer*/
    union {
        struct {
            uint32_t waiti_en:             1;                   /*auto-waiting flash idle operation when program flash or erase flash. 1: enable 0: disable.*/
            uint32_t waiti_dummy:          1;                   /*The dummy phase enable when auto wait flash idle*/
            uint32_t waiti_cmd:            8;                   /*The command to auto wait idle*/
            uint32_t waiti_dummy_cyclelen: 8;                   /*The dummy cycle length when auto wait flash idle*/
            uint32_t reserved18:          14;                   /*reserved*/
        };
        uint32_t val;
    } flash_waiti_ctrl;
    union {
        struct {
            uint32_t flash_per:  1;                             /*program erase resume bit  program erase suspend operation will be triggered when the bit is set. The bit will be cleared once the operation done.1: enable 0: disable.*/
            uint32_t flash_pes:  1;                             /*program erase suspend bit  program erase suspend operation will be triggered when the bit is set. The bit will be cleared once the operation done.1: enable 0: disable.*/
            uint32_t reserved2: 30;
        };
        uint32_t val;
    } flash_sus_cmd;
    union {
        struct {
            uint32_t flash_pes_en:      1;                      /*Auto-suspending enable*/
            uint32_t flash_per_command: 8;                      /*Program/Erase resume command.*/
            uint32_t flash_pes_command: 8;                      /*Program/Erase suspend command.*/
            uint32_t reserved17:       15;
        };
        uint32_t val;
    } flash_sus_ctrl;
    union {
        struct {
            uint32_t din0_mode:     2;                          /*the input signals are delayed by system clock cycles  0: input without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb  3: input with the spi_clk*/
            uint32_t din1_mode:     2;                          /*the input signals are delayed by system clock cycles  0: input without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb  3: input with the spi_clk*/
            uint32_t din2_mode:     2;                          /*the input signals are delayed by system clock cycles  0: input without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb  3: input with the spi_clk*/
            uint32_t din3_mode:     2;                          /*the input signals are delayed by system clock cycles  0: input without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb  3: input with the spi_clk*/
            uint32_t reserved8:    10;                          /*reserved*/
            uint32_t din0_dly_edge: 1;                          /*The bit is used to select the spi clock edge to modify input line timing.*/
            uint32_t din1_dly_edge: 1;                          /*The bit is used to select the spi clock edge to modify input line timing.*/
            uint32_t din2_dly_edge: 1;                          /*The bit is used to select the spi clock edge to modify input line timing.*/
            uint32_t din3_dly_edge: 1;                          /*The bit is used to select the spi clock edge to modify input line timing.*/
            uint32_t reserved22:   10;                          /*reserved*/
        };
        uint32_t val;
    } din_mode;
    union {
        struct {
            uint32_t din0_num:   2;                             /*the input signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t din1_num:   2;                             /*the input signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t din2_num:   2;                             /*the input signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t din3_num:   2;                             /*the input signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t reserved8: 24;                             /*reserved*/
        };
        uint32_t val;
    } din_num;
    union {
        struct {
            uint32_t dout0_mode:     2;                         /*the output signals are delayed by system clock cycles  0: output without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
            uint32_t dout1_mode:     2;                         /*the output signals are delayed by system clock cycles  0: output without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
            uint32_t dout2_mode:     2;                         /*the output signals are delayed by system clock cycles  0: output without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
            uint32_t dout3_mode:     2;                         /*the output signals are delayed by system clock cycles  0: output without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
            uint32_t reserved8:     10;                         /*the output signals are delayed by system clock cycles  0: output without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
            uint32_t dout0_dly_edge: 1;                         /*The bit is used to select the spi clock edge to modify output line timing.*/
            uint32_t dout1_dly_edge: 1;                         /*The bit is used to select the spi clock edge to modify output line timing.*/
            uint32_t dout2_dly_edge: 1;                         /*The bit is used to select the spi clock edge to modify output line timing.*/
            uint32_t dout3_dly_edge: 1;                         /*The bit is used to select the spi clock edge to modify output line timing.*/
            uint32_t reserved22:    10;                         /*reserved*/
        };
        uint32_t val;
    } dout_mode;
    union {
        struct {
            uint32_t dout0_num:  2;                             /*the output signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t dout1_num:  2;                             /*the output signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t dout2_num:  2;                             /*the output signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t dout3_num:  2;                             /*the output signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t reserved8: 24;                             /*reserved*/
        };
        uint32_t val;
    } dout_num;
    union {
        struct {
            uint32_t sdin0_mode:     2;                         /*the input signals are delayed by system clock cycles  0: input without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb  3: input with the spi_clk*/
            uint32_t sdin1_mode:     2;                         /*the input signals are delayed by system clock cycles  0: input without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb  3: input with the spi_clk*/
            uint32_t sdin2_mode:     2;                         /*the input signals are delayed by system clock cycles  0: input without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb  3: input with the spi_clk*/
            uint32_t sdin3_mode:     2;                         /*the input signals are delayed by system clock cycles  0: input without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb  3: input with the spi_clk*/
            uint32_t reserved8:     10;
            uint32_t sdin0_dly_edge: 1;                         /*The bit is used to select the spi clock edge to modify input line timing.*/
            uint32_t sdin1_dly_edge: 1;                         /*The bit is used to select the spi clock edge to modify input line timing.*/
            uint32_t sdin2_dly_edge: 1;                         /*The bit is used to select the spi clock edge to modify input line timing.*/
            uint32_t sdin3_dly_edge: 1;                         /*The bit is used to select the spi clock edge to modify input line timing.*/
            uint32_t reserved22:    10;                         /*reserved*/
        };
        uint32_t val;
    } sdin_mode;
    union {
        struct {
            uint32_t sdin0_num:  2;                             /*the input signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t sdin1_num:  2;                             /*the input signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t sdin2_num:  2;                             /*the input signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t sdin3_num:  2;                             /*the input signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t reserved8: 24;                             /*reserved*/
        };
        uint32_t val;
    } sdin_num;
    union {
        struct {
            uint32_t sdout0_mode:     2;                        /*the output signals are delayed by system clock cycles  0: output without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
            uint32_t sdout1_mode:     2;                        /*the output signals are delayed by system clock cycles  0: output without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
            uint32_t sdout2_mode:     2;                        /*the output signals are delayed by system clock cycles  0: output without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
            uint32_t sdout3_mode:     2;                        /*the output signals are delayed by system clock cycles  0: output without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
            uint32_t reserved8:      10;                        /*the output signals are delayed by system clock cycles  0: output without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
            uint32_t sdout0_dly_edge: 1;                        /*The bit is used to select the spi clock edge to modify output line timing.*/
            uint32_t sdout1_dly_edge: 1;                        /*The bit is used to select the spi clock edge to modify output line timing.*/
            uint32_t sdout2_dly_edge: 1;                        /*The bit is used to select the spi clock edge to modify output line timing.*/
            uint32_t sdout3_dly_edge: 1;                        /*The bit is used to select the spi clock edge to modify output line timing.*/
            uint32_t reserved22:     10;                        /*reserved*/
        };
        uint32_t val;
    } sdout_mode;
    union {
        struct {
            uint32_t sdout0_num: 2;                             /*the output signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t sdout1_num: 2;                             /*the output signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t sdout2_num: 2;                             /*the output signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
